Repository: xiaocang/easydict_win32
Catalog: dotnet/src/Easydict.WinUI/Strings/*/Resources.resw
Source language: en_us
Languages: ar_sa, da_dk, de_de, fr_fr, hi_in, id_id, it_it, ja_jp, ko_kr, ms_my, th_th, vi_vn, zh_cn, zh_tw

source: Bypass proxy for localhost
ar_sa: تجاوز الوكيل للمضيف المحلي
da_dk: Omgå proxy for localhost
de_de: Proxy für localhost umgehen
fr_fr: Contourner le proxy pour localhost
hi_in: localhost के लिए proxy बायपास करें
id_id: Lewati proxy untuk localhost
it_it: Bypassa il proxy per localhost
ja_jp: localhostのプロキシをバイパス
ko_kr: localhost 프록시 우회
ms_my: Pintas proksi untuk localhost
th_th: ข้าม proxy สำหรับ localhost
vi_vn: Bỏ qua proxy cho localhost
zh_cn: 本地地址绕过代理
zh_tw: 本機位址繞過代理

# ProxyDescription
source: Proxy changes take effect after app restart. Localhost bypass ensures Ollama works without proxy.
ar_sa: تسري تغييرات الوكيل بعد إعادة تشغيل التطبيق. تجاوز المضيف المحلي يضمن عمل Ollama بدون وكيل.
da_dk: Proxyændringer træder i kraft efter genstart af appen. Localhost-omgåelse sikrer, at Ollama fungerer uden proxy.
de_de: Proxy-Änderungen werden nach Neustart der App wirksam. Localhost-Umgehung stellt sicher, dass Ollama ohne Proxy funktioniert.
fr_fr: Les modifications du proxy prennent effet après le redémarrage de l'application. Le contournement localhost assure le fonctionnement d'Ollama sans proxy.
hi_in: Proxy परिवर्तन ऐप पुनः आरंभ के बाद लागू होते हैं। Localhost बायपास सुनिश्चित करता है कि Ollama बिना proxy के काम करे।
id_id: Perubahan proxy berlaku setelah aplikasi dimulai ulang. Melewati localhost memastikan Ollama berfungsi tanpa proxy.
it_it: Le modifiche al proxy hanno effetto dopo il riavvio dell'app. Il bypass di localhost garantisce il funzionamento di Ollama senza proxy.
ja_jp: プロキシの変更はアプリ再起動後に有効になります。localhostバイパスでOllamaがプロキシなしで動作します。
ko_kr: 프록시 변경은 앱 재시작 후 적용됩니다. localhost 우회로 Ollama가 프록시 없이 작동합니다.
ms_my: Perubahan proksi berkuat kuasa selepas aplikasi dimulakan semula. Pintasan localhost memastikan Ollama berfungsi tanpa proksi.
th_th: การเปลี่ยน proxy จะมีผลหลังจากรีสตาร์ทแอป การข้าม localhost ช่วยให้ Ollama ทำงานได้โดยไม่ต้องใช้ proxy
vi_vn: Thay đổi proxy có hiệu lực sau khi khởi động lại ứng dụng. Bỏ qua localhost đảm bảo Ollama hoạt động không cần proxy.
zh_cn: 代理更改在应用重启后生效。本地绕过确保 Ollama 无需代理即可工作。
zh_tw: 代理變更在應用程式重新啟動後生效。本機繞過確保 Ollama 無需代理即可運作。

source: Behavior
ar_sa: السلوك
da_dk: Adfærd
de_de: Verhalten
fr_fr: Comportement
hi_in: व्यवहार
id_id: Perilaku
it_it: Comportamento
ja_jp: 動作
ko_kr: 동작
ms_my: Tingkah Laku
th_th: พฤติกรรม
vi_vn: Hành vi
zh_cn: 行为
zh_tw: 行為

# MinimizeToTray
source: Minimize to system tray
ar_sa: تصغير إلى علبة النظام
da_dk: Minimer til systembakke
de_de: In Taskleiste minimieren
fr_fr: Réduire dans la barre des tâches
hi_in: सिस्टम ट्रे में छोटा करें
id_id: Minimalkan ke baki sistem
it_it: Minimizza nella barra di sistema
ja_jp: システムトレイに最小化
ko_kr: 시스템 트레이로 최소화
ms_my: Kecilkan ke dulang sistem
th_th: ย่อลงในถาดระบบ
vi_vn: Thu nhỏ vào khay hệ thống
zh_cn: 最小化到系统托盘
zh_tw: 最小化到系統匣

# MonitorClipboard
source: Monitor clipboard for text
ar_sa: مراقبة الحافظة للنصوص
da_dk: Overvåg udklipsholder for tekst
de_de: Zwischenablage auf Text überwachen
fr_fr: Surveiller le presse-papiers
hi_in: क्लिपबोर्ड पर नज़र रखें
id_id: Pantau papan klip untuk teks
it_it: Monitora gli appunti per il testo
ja_jp: クリップボードのテキストを監視
ko_kr: 클립보드 텍스트 모니터링
ms_my: Pantau papan keratan untuk teks
th_th: ตรวจสอบคลิปบอร์ด
vi_vn: Theo dõi clipboard
zh_cn: 监控剪贴板文本
zh_tw: 監控剪貼簿文字

source: Always on top
ar_sa: دائماً في المقدمة
da_dk: Altid øverst
de_de: Immer im Vordergrund
fr_fr: Toujours au premier plan
hi_in: हमेशा ऊपर
id_id: Selalu di atas
it_it: Sempre in primo piano
ja_jp: 常に最前面
ko_kr: 항상 위
ms_my: Sentiasa di atas
th_th: แสดงด้านบนเสมอ
vi_vn: Luôn hiển thị trên cùng
zh_cn: 始终置顶
zh_tw: 始終置頂

# LaunchAtStartup
source: Launch at Windows startup
ar_sa: التشغيل عند بدء Windows
da_dk: Start ved Windows-opstart
de_de: Bei Windows-Start ausführen
fr_fr: Lancer au démarrage de Windows
hi_in: Windows शुरू होने पर लॉन्च करें
id_id: Jalankan saat Windows dimulai
it_it: Avvia all'avvio di Windows
ja_jp: Windows起動時に起動
ko_kr: Windows 시작 시 실행
ms_my: Lancar semasa Windows dimulakan
th_th: เปิดเมื่อเริ่มต้น Windows
vi_vn: Khởi chạy cùng Windows
zh_cn: 开机自启动
zh_tw: 開機自動啟動

source: Hotkeys
ar_sa: اختصارات لوحة المفاتيح
da_dk: Genvejstaster
de_de: Tastenkürzel
fr_fr: Raccourcis clavier
hi_in: शॉर्टकट कुंजियाँ
id_id: Pintasan
it_it: Tasti rapidi
ja_jp: ホットキー
ko_kr: 단축키
ms_my: Kekunci Pintas
th_th: คีย์ลัด
vi_vn: Phím tắt
zh_cn: 快捷键
zh_tw: 快速鍵

source: Show Window
ar_sa: إظهار النافذة
da_dk: Vis vindue
de_de: Fenster anzeigen
fr_fr: Afficher la fenêtre
hi_in: विंडो दिखाएँ
id_id: Tampilkan Jendela
it_it: Mostra finestra
ja_jp: ウィンドウを表示
ko_kr: 창 표시
ms_my: Papar Tetingkap
th_th: แสดงหน้าต่าง
vi_vn: Hiển thị cửa sổ
zh_cn: 显示窗口
zh_tw: 顯示視窗

source: Translate Selection
ar_sa: ترجمة النص المحدد
da_dk: Oversæt markering
de_de: Auswahl übersetzen
fr_fr: Traduire la sélection
hi_in: चयन का अनुवाद करें
id_id: Terjemahkan Pilihan
it_it: Traduci selezione
ja_jp: 選択テキストを翻訳
ko_kr: 선택 번역
ms_my: Terjemah Pilihan
th_th: แปลข้อความที่เลือก
vi_vn: Dịch văn bản đã chọn
zh_cn: 翻译选中文本
zh_tw: 翻譯選取文字

source: Show Mini Window
ar_sa: إظهار النافذة المصغّرة
da_dk: Vis minivindue
de_de: Mini-Fenster anzeigen
fr_fr: Afficher la mini fenêtre
hi_in: मिनी विंडो दिखाएँ
id_id: Tampilkan Jendela Mini
it_it: Mostra finestra mini
ja_jp: ミニウィンドウを表示
ko_kr: 미니 창 표시
ms_my: Papar Tetingkap Mini
th_th: แสดงหน้าต่างขนาดเล็ก
vi_vn: Hiển thị cửa sổ nhỏ
zh_cn: 显示迷你窗口
zh_tw: 顯示迷你視窗

source: Show Fixed Window
ar_sa: إظهار النافذة الثابتة
da_dk: Vis fast vindue
de_de: Fixiertes Fenster anzeigen
fr_fr: Afficher la fenêtre fixe
hi_in: स्थिर विंडो दिखाएँ
id_id: Tampilkan Jendela Tetap
it_it: Mostra finestra fissa
ja_jp: 固定ウィンドウを表示
ko_kr: 고정 창 표시
ms_my: Papar Tetingkap Tetap
th_th: แสดงหน้าต่างคงที่
vi_vn: Hiển thị cửa sổ cố định
zh_cn: 显示固定窗口
zh_tw: 顯示固定視窗

source: OCR Screenshot Translate
fr_fr: Traduction OCR par capture d'écran
ja_jp: OCR スクリーンショット翻訳
ko_kr: OCR 스크린샷 번역
zh_cn: OCR 截图翻译
zh_tw: OCR 截圖翻譯

source: Silent OCR
fr_fr: OCR silencieux
ja_jp: サイレント OCR
ko_kr: 무음 OCR
zh_cn: 静默 OCR
zh_tw: 靜默 OCR

# HotkeysDescription
source: Note: Restart app to apply hotkey changes. Toggle hotkeys use the same key with Shift added (e.g., Ctrl+Alt+Shift+M).
ar_sa: ملاحظة: أعد تشغيل التطبيق لتطبيق تغييرات الاختصارات. اختصارات التبديل تستخدم نفس المفتاح مع Shift (مثل Ctrl+Alt+Shift+M).
da_dk: Bemærk: Genstart appen for at anvende genvejstastændringer. Skiftetaster bruger samme tast med Shift (f.eks. Ctrl+Alt+Shift+M).
de_de: Hinweis: Starten Sie die App neu, um Tastenkürzel-Änderungen anzuwenden. Umschalt-Tastenkürzel verwenden dieselbe Taste mit zusätzlicher Umschalttaste (z.B. Strg+Alt+Umschalt+M).
fr_fr: Note : Redémarrez l'application pour appliquer les changements de raccourcis. Les raccourcis de bascule utilisent la même touche avec Shift ajouté (ex : Ctrl+Alt+Shift+M).
hi_in: नोट: शॉर्टकट कुंजी परिवर्तन लागू करने के लिए ऐप पुनः आरंभ करें। टॉगल शॉर्टकट कुंजियाँ Shift के साथ समान कुंजी का उपयोग करती हैं (जैसे Ctrl+Alt+Shift+M)।
id_id: Catatan: Mulai ulang aplikasi untuk menerapkan perubahan pintasan. Pintasan toggle menggunakan tombol yang sama dengan Shift (mis. Ctrl+Alt+Shift+M).
it_it: Nota: Riavvia l'app per applicare le modifiche ai tasti rapidi. I tasti di commutazione usano lo stesso tasto con Shift (ad es. Ctrl+Alt+Shift+M).
ja_jp: 注意：ホットキーの変更を適用するにはアプリを再起動してください。切り替えホットキーは同じキーにShiftを追加します（例：Ctrl+Alt+Shift+M）。
ko_kr: 참고: 단축키 변경을 적용하려면 앱을 다시 시작하세요. 토글 단축키는 같은 키에 Shift를 추가합니다 (예: Ctrl+Alt+Shift+M).
ms_my: Nota: Mulakan semula aplikasi untuk menerapkan perubahan kekunci pintas. Kekunci pintas togol menggunakan kekunci yang sama dengan Shift (cth. Ctrl+Alt+Shift+M).
th_th: หมายเหตุ: รีสตาร์ทแอปเพื่อใช้การเปลี่ยนแปลงคีย์ลัด คีย์ลัดสลับใช้ปุ่มเดียวกันพร้อม Shift (เช่น Ctrl+Alt+Shift+M)
vi_vn: Lưu ý: Khởi động lại ứng dụng để áp dụng thay đổi phím tắt. Phím tắt chuyển đổi sử dụng cùng phím với Shift (ví dụ: Ctrl+Alt+Shift+M).
zh_cn: 注意：重启应用以应用快捷键更改。切换快捷键使用相同的键加 Shift（例如 Ctrl+Alt+Shift+M）。
zh_tw: 注意：重新啟動應用程式以套用快速鍵變更。切換快速鍵使用相同的鍵加 Shift（例如 Ctrl+Alt+Shift+M）。

source: About
ar_sa: حول
da_dk: Om
de_de: Über
fr_fr: À propos
hi_in: के बारे में
id_id: Tentang
it_it: Informazioni
ja_jp: このアプリについて
ko_kr: 정보
ms_my: Perihal
th_th: เกี่ยวกับ
vi_vn: Giới thiệu
zh_cn: 关于
zh_tw: 關於

source: Easydict for Windows
ar_sa: Easydict لنظام Windows
da_dk: Easydict til Windows
de_de: Easydict für Windows
fr_fr: Easydict pour Windows
hi_in: Windows के लिए Easydict
id_id: Easydict untuk Windows
it_it: Easydict per Windows
ko_kr: Windows용 Easydict
ms_my: Easydict untuk Windows
th_th: Easydict สำหรับ Windows
vi_vn: Easydict cho Windows
zh_cn: Easydict Windows 版
zh_tw: Easydict Windows 版

source: GitHub Repository
ar_sa: مستودع GitHub
fr_fr: Dépôt GitHub
hi_in: GitHub रिपॉज़िटरी
id_id: Repositori GitHub
it_it: Repository GitHub
ja_jp: GitHubリポジトリ
ko_kr: GitHub 저장소
ms_my: Repositori GitHub
th_th: คลัง GitHub
vi_vn: Kho GitHub
zh_cn: GitHub 仓库
zh_tw: GitHub 儲存庫

source: Issue Feedback
ar_sa: الإبلاغ عن مشكلة
da_dk: Rapporter problem
de_de: Problem melden
fr_fr: Signaler un problème
hi_in: समस्या प्रतिक्रिया
id_id: Laporkan Masalah
it_it: Segnala un problema
ja_jp: 問題のフィードバック
ko_kr: 문제 피드백
ms_my: Maklum Balas Isu
th_th: แจ้งปัญหา
vi_vn: Phản hồi lỗi
zh_cn: 问题反馈
zh_tw: 問題回饋

source: Inspired by
ar_sa: مستوحى من
da_dk: Inspireret af
de_de: Inspiriert von
fr_fr: Inspiré par
hi_in: से प्रेरित
id_id: Terinspirasi dari
it_it: Ispirato da
ja_jp: インスピレーション元
ko_kr: 영감을 받은 곳
ms_my: Diilhamkan oleh
th_th: ได้แรงบันดาลใจจาก
vi_vn: Lấy cảm hứng từ
zh_cn: 灵感来自
zh_tw: 靈感來自

source: Easydict for macOS
ar_sa: Easydict لنظام macOS
da_dk: Easydict til macOS
de_de: Easydict für macOS
fr_fr: Easydict pour macOS
hi_in: macOS के लिए Easydict
id_id: Easydict untuk macOS
it_it: Easydict per macOS
ko_kr: macOS용 Easydict
ms_my: Easydict untuk macOS
th_th: Easydict สำหรับ macOS
vi_vn: Easydict cho macOS
zh_cn: Easydict macOS 版
zh_tw: Easydict macOS 版

# License
source: License: GPL-3.0
ar_sa: الترخيص: GPL-3.0
da_dk: Licens: GPL-3.0
de_de: Lizenz: GPL-3.0
fr_fr: Licence : GPL-3.0
hi_in: लाइसेंस: GPL-3.0
id_id: Lisensi: GPL-3.0
it_it: Licenza: GPL-3.0
ja_jp: ライセンス：GPL-3.0
ko_kr: 라이선스: GPL-3.0
ms_my: Lesen: GPL-3.0
th_th: สัญญาอนุญาต: GPL-3.0
vi_vn: Giấy phép: GPL-3.0
zh_cn: 许可证：GPL-3.0
zh_tw: 授權條款：GPL-3.0

source: Save Settings
ar_sa: حفظ الإعدادات
da_dk: Gem indstillinger
de_de: Einstellungen speichern
fr_fr: Enregistrer les paramètres
hi_in: सेटिंग्स सहेजें
id_id: Simpan Pengaturan
it_it: Salva impostazioni
ja_jp: 設定を保存
ko_kr: 설정 저장
ms_my: Simpan Tetapan
th_th: บันทึกการตั้งค่า
vi_vn: Lưu cài đặt
zh_cn: 保存设置
zh_tw: 儲存設定

source: Back
ar_sa: رجوع
da_dk: Tilbage
de_de: Zurück
fr_fr: Retour
hi_in: वापस
id_id: Kembali
it_it: Indietro
ja_jp: 戻る
ko_kr: 뒤로
ms_my: Kembali
th_th: ย้อนกลับ
vi_vn: Quay lại
zh_cn: 返回
zh_tw: 返回

source: Back to top
ar_sa: العودة للأعلى
da_dk: Tilbage til toppen
de_de: Nach oben
fr_fr: Retour en haut
hi_in: शीर्ष पर वापस
id_id: Kembali ke atas
it_it: Torna in alto
ja_jp: トップへ戻る
ko_kr: 맨 위로
ms_my: Kembali ke atas
th_th: กลับด้านบน
vi_vn: Về đầu trang
zh_cn: 返回顶部
zh_tw: 返回頂部

source: Copy
ar_sa: نسخ
da_dk: Kopier
de_de: Kopieren
fr_fr: Copier
hi_in: कॉपी
id_id: Salin
it_it: Copia
ja_jp: コピー
ko_kr: 복사
ms_my: Salin
th_th: คัดลอก
vi_vn: Sao chép
zh_cn: 复制
zh_tw: 複製

source: Insert/Replace
ar_sa: إدراج/استبدال
da_dk: Indsæt/Erstat
de_de: Einfügen/Ersetzen
fr_fr: Insérer/Remplacer
hi_in: सम्मिलित/बदलें
id_id: Sisipkan/Ganti
it_it: Inserisci/Sostituisci
ja_jp: 挿入/置換
ko_kr: 삽입/교체
ms_my: Sisip/Ganti
th_th: แทรก/แทนที่
vi_vn: Chèn/Thay thế
zh_cn: 插入/替换
zh_tw: 插入/替換

source: Copy All
ar_sa: نسخ الكل
da_dk: Kopier alt
de_de: Alle kopieren
fr_fr: Tout copier
hi_in: सब कॉपी करें
id_id: Salin Semua
it_it: Copia tutto
ja_jp: すべてコピー
ko_kr: 모두 복사
ms_my: Salin Semua
th_th: คัดลอกทั้งหมด
vi_vn: Sao chép tất cả
zh_cn: 复制全部
zh_tw: 複製全部

source: Translation failed
ar_sa: فشلت الترجمة
da_dk: Oversættelse mislykkedes
de_de: Übersetzung fehlgeschlagen
fr_fr: Échec de la traduction
hi_in: अनुवाद विफल
id_id: Terjemahan gagal
it_it: Traduzione fallita
ja_jp: 翻訳に失敗しました
ko_kr: 번역 실패
ms_my: Terjemahan gagal
th_th: การแปลล้มเหลว
vi_vn: Dịch thất bại
zh_cn: 翻译失败
zh_tw: 翻譯失敗

source: Service not initialized
ar_sa: الخدمة غير مهيأة
da_dk: Tjeneste ikke initialiseret
de_de: Dienst nicht initialisiert
fr_fr: Service non initialisé
hi_in: सेवा आरंभ नहीं हुई
id_id: Layanan belum diinisialisasi
it_it: Servizio non inizializzato
ja_jp: サービスが初期化されていません
ko_kr: 서비스가 초기화되지 않았습니다
ms_my: Perkhidmatan belum dimulakan
th_th: บริการยังไม่ได้เริ่มต้น
vi_vn: Dịch vụ chưa khởi tạo
zh_cn: 服务未初始化
zh_tw: 服務未初始化

# NoServicesEnabled
source: No services enabled. Go to Settings to enable services.
ar_sa: لا توجد خدمات مفعّلة. انتقل إلى الإعدادات لتفعيل الخدمات.
da_dk: Ingen tjenester aktiveret. Gå til Indstillinger for at aktivere tjenester.
de_de: Keine Dienste aktiviert. Gehen Sie zu den Einstellungen, um Dienste zu aktivieren.
fr_fr: Aucun service activé. Allez dans les paramètres pour activer des services.
hi_in: कोई सेवा सक्रिय नहीं है। सेवाएँ सक्रिय करने के लिए सेटिंग्स में जाएँ।
id_id: Tidak ada layanan yang diaktifkan. Buka Pengaturan untuk mengaktifkan layanan.
it_it: Nessun servizio abilitato. Vai alle Impostazioni per abilitare i servizi.
ja_jp: サービスが有効になっていません。設定からサービスを有効にしてください。
ko_kr: 활성화된 서비스가 없습니다. 설정에서 서비스를 활성화하세요.
ms_my: Tiada perkhidmatan diaktifkan. Pergi ke Tetapan untuk mengaktifkan perkhidmatan.
th_th: ไม่มีบริการที่เปิดใช้งาน ไปที่การตั้งค่าเพื่อเปิดใช้งานบริการ
vi_vn: Chưa bật dịch vụ nào. Vào Cài đặt để bật dịch vụ.
zh_cn: 未启用任何服务。请前往设置启用服务。
zh_tw: 未啟用任何服務。請前往設定啟用服務。

# ServiceResultsComplete
source: {0} service(s) completed
ar_sa: اكتملت {0} خدمة (خدمات)
da_dk: {0} tjeneste(r) fuldført
de_de: {0} Dienst(e) abgeschlossen
fr_fr: {0} service(s) terminé(s)
hi_in: {0} सेवा(एँ) पूर्ण
id_id: {0} layanan selesai
it_it: {0} servizio/i completato/i
ja_jp: {0} 件のサービスが完了
ko_kr: {0}개 서비스 완료
ms_my: {0} perkhidmatan selesai
th_th: {0} บริการเสร็จสิ้น
vi_vn: {0} dịch vụ đã hoàn thành
zh_cn: {0} 个服务已完成
zh_tw: {0} 個服務已完成

source: Invalid Language Selection
ar_sa: اختيار لغة غير صالح
da_dk: Ugyldigt sprogvalg
de_de: Ungültige Sprachauswahl
fr_fr: Sélection de langue invalide
hi_in: अमान्य भाषा चयन
id_id: Pilihan Bahasa Tidak Valid
it_it: Selezione lingua non valida
ja_jp: 無効な言語選択
ko_kr: 잘못된 언어 선택
ms_my: Pilihan Bahasa Tidak Sah
th_th: การเลือกภาษาไม่ถูกต้อง
vi_vn: Chọn ngôn ngữ không hợp lệ
zh_cn: 无效的语言选择
zh_tw: 無效的語言選擇

# InvalidLanguageSelectionMessage
source: First Language and Second Language cannot be the same.
ar_sa: لا يمكن أن تكون اللغة الأولى والثانية متطابقتين.
da_dk: Første sprog og Andet sprog kan ikke være ens.
de_de: Erste Sprache und zweite Sprache dürfen nicht identisch sein.
fr_fr: La première langue et la deuxième langue ne peuvent pas être identiques.
hi_in: प्रथम भाषा और द्वितीय भाषा एक समान नहीं हो सकतीं।
id_id: Bahasa Pertama dan Bahasa Kedua tidak boleh sama.
it_it: La Prima lingua e la Seconda lingua non possono essere uguali.
ja_jp: 第一言語と第二言語を同じにすることはできません。
ko_kr: 제1언어와 제2언어는 같을 수 없습니다.
ms_my: Bahasa Pertama dan Bahasa Kedua tidak boleh sama.
th_th: ภาษาที่หนึ่งและภาษาที่สองต้องไม่เหมือนกัน
vi_vn: Ngôn ngữ thứ nhất và thứ hai không thể giống nhau.
zh_cn: 第一语言和第二语言不能相同。
zh_tw: 第一語言與第二語言不能相同。

source: Invalid Proxy URL
ar_sa: عنوان وكيل غير صالح
da_dk: Ugyldig proxy-URL
de_de: Ungültige Proxy-URL
fr_fr: URL de proxy invalide
hi_in: अमान्य Proxy URL
id_id: URL Proxy Tidak Valid
it_it: URL proxy non valido
ja_jp: 無効なプロキシURL
ko_kr: 잘못된 프록시 URL
ms_my: URL Proksi Tidak Sah
th_th: URL ของ Proxy ไม่ถูกต้อง
vi_vn: URL Proxy không hợp lệ
zh_cn: 无效的代理地址
zh_tw: 無效的代理位址

# InvalidProxyUrlMessage
source: The proxy URL is not valid. Please enter a valid URL (e.g., http://127.0.0.1:7890).
ar_sa: عنوان الوكيل غير صالح. الرجاء إدخال عنوان صالح (مثل http://127.0.0.1:7890).
da_dk: Proxy-URL'en er ugyldig. Indtast venligst en gyldig URL (f.eks. http://127.0.0.1:7890).
de_de: Die Proxy-URL ist ungültig. Bitte geben Sie eine gültige URL ein (z. B. http://127.0.0.1:7890).
fr_fr: L'URL du proxy n'est pas valide. Veuillez entrer une URL valide (ex. : http://127.0.0.1:7890).
hi_in: Proxy URL अमान्य है। कृपया एक मान्य URL दर्ज करें (जैसे http://127.0.0.1:7890)।
id_id: URL proxy tidak valid. Silakan masukkan URL yang valid (mis. http://127.0.0.1:7890).
it_it: L'URL del proxy non è valido. Inserisci un URL valido (ad es. http://127.0.0.1:7890).
ja_jp: プロキシURLが無効です。有効なURLを入力してください（例：http://127.0.0.1:7890）。
ko_kr: 프록시 URL이 유효하지 않습니다. 올바른 URL을 입력하세요 (예: http://127.0.0.1:7890).
ms_my: URL proksi tidak sah. Sila masukkan URL yang sah (cth. http://127.0.0.1:7890).
th_th: URL ของ proxy ไม่ถูกต้อง กรุณาใส่ URL ที่ถูกต้อง (เช่น http://127.0.0.1:7890)
vi_vn: URL proxy không hợp lệ. Vui lòng nhập URL hợp lệ (ví dụ: http://127.0.0.1:7890).
zh_cn: 代理地址无效。请输入有效的地址（例如 http://127.0.0.1:7890）。
zh_tw: 代理伺服器網址無效。請輸入有效的網址（例如：http://127.0.0.1:7890）。

source: Settings Saved
ar_sa: تم حفظ الإعدادات
da_dk: Indstillinger gemt
de_de: Einstellungen gespeichert
fr_fr: Paramètres enregistrés
hi_in: सेटिंग्स सहेजी गईं
id_id: Pengaturan Disimpan
it_it: Impostazioni salvate
ja_jp: 設定を保存しました
ko_kr: 설정이 저장되었습니다
ms_my: Tetapan Disimpan
th_th: บันทึกการตั้งค่าแล้ว
vi_vn: Đã lưu cài đặt
zh_cn: 设置已保存
zh_tw: 設定已儲存

# SettingsSavedMessage
source: Your settings have been saved successfully.
ar_sa: تم حفظ إعداداتك بنجاح.
da_dk: Dine indstillinger er blevet gemt.
de_de: Ihre Einstellungen wurden erfolgreich gespeichert.
fr_fr: Vos paramètres ont été enregistrés avec succès.
hi_in: आपकी सेटिंग्स सफलतापूर्वक सहेजी गई हैं।
id_id: Pengaturan Anda telah berhasil disimpan.
it_it: Le impostazioni sono state salvate con successo.
ja_jp: 設定が正常に保存されました。
ko_kr: 설정이 성공적으로 저장되었습니다.
ms_my: Tetapan anda telah berjaya disimpan.
th_th: การตั้งค่าของคุณได้รับการบันทึกเรียบร้อยแล้ว
vi_vn: Cài đặt của bạn đã được lưu thành công.
zh_cn: 您的设置已成功保存。
zh_tw: 您的設定已成功儲存。

source: Restart Required
ar_sa: يلزم إعادة التشغيل
da_dk: Genstart påkrævet
de_de: Neustart erforderlich
fr_fr: Redémarrage requis
hi_in: पुनः आरंभ आवश्यक
id_id: Perlu Dimulai Ulang
it_it: Riavvio necessario
ja_jp: 再起動が必要
ko_kr: 재시작 필요
ms_my: Perlu Dimulakan Semula
th_th: ต้องรีสตาร์ท
vi_vn: Cần khởi động lại
zh_cn: 需要重启
zh_tw: 需要重新啟動

source: Cannot Connect to Ollama
ar_sa: لا يمكن الاتصال بـ Ollama
da_dk: Kan ikke oprette forbindelse til Ollama
de_de: Verbindung zu Ollama nicht möglich
fr_fr: Impossible de se connecter à Ollama
hi_in: Ollama से कनेक्ट नहीं हो सकता
id_id: Tidak Dapat Terhubung ke Ollama
it_it: Impossibile connettersi a Ollama
ja_jp: Ollamaに接続できません
ko_kr: Ollama에 연결할 수 없습니다
ms_my: Tidak Dapat Menyambung ke Ollama
th_th: ไม่สามารถเชื่อมต่อ Ollama
vi_vn: Không thể kết nối Ollama
zh_cn: 无法连接到 Ollama
zh_tw: 無法連線到 Ollama

# CannotConnectToOllamaMessage
source: Failed to fetch models from Ollama. Make sure Ollama is running and accessible.
ar_sa: فشل جلب النماذج من Ollama. تأكد من أن Ollama قيد التشغيل ويمكن الوصول إليه.
da_dk: Kunne ikke hente modeller fra Ollama. Sørg for, at Ollama kører og er tilgængelig.
de_de: Modelle konnten nicht von Ollama abgerufen werden. Stellen Sie sicher, dass Ollama ausgeführt wird und erreichbar ist.
fr_fr: Impossible de récupérer les modèles depuis Ollama. Assurez-vous qu'Ollama est en cours d'exécution et accessible.
hi_in: Ollama से model प्राप्त करने में विफल। सुनिश्चित करें कि Ollama चल रहा है और पहुँच योग्य है।
id_id: Gagal mengambil model dari Ollama. Pastikan Ollama berjalan dan dapat diakses.
it_it: Impossibile recuperare i modelli da Ollama. Assicurati che Ollama sia in esecuzione e accessibile.
ja_jp: Ollamaからモデルを取得できませんでした。Ollamaが実行中でアクセス可能であることを確認してください。
ko_kr: Ollama에서 모델을 가져올 수 없습니다. Ollama가 실행 중이고 접근 가능한지 확인하세요.
ms_my: Gagal mendapatkan model dari Ollama. Pastikan Ollama sedang berjalan dan boleh diakses.
th_th: ไม่สามารถดึงรายการ model จาก Ollama ตรวจสอบให้แน่ใจว่า Ollama กำลังทำงานและสามารถเข้าถึงได้
vi_vn: Không thể lấy danh sách model từ Ollama. Hãy đảm bảo Ollama đang chạy và có thể truy cập.
zh_cn: 无法从 Ollama 获取模型列表。请确保 Ollama 正在运行并可访问。
zh_tw: 無法從 Ollama 取得模型。請確認 Ollama 正在執行且可以存取。

source: Copied!
ar_sa: تم النسخ!
da_dk: Kopieret!
de_de: Kopiert!
fr_fr: Copié !
hi_in: कॉपी हो गया!
id_id: Disalin!
it_it: Copiato!
ja_jp: コピーしました！
ko_kr: 복사됨!
ms_my: Disalin!
th_th: คัดลอกแล้ว!
vi_vn: Đã sao chép!
zh_cn: 已复制！
zh_tw: 已複製！

# DetectedLanguage
source: Detected: {0}
ar_sa: المكتشفة: {0}
da_dk: Registreret: {0}
de_de: Erkannt: {0}
fr_fr: Détecté : {0}
hi_in: पहचाना गया: {0}
id_id: Terdeteksi: {0}
it_it: Rilevata: {0}
ja_jp: 検出：{0}
ko_kr: 감지됨: {0}
ms_my: Dikesan: {0}
th_th: ตรวจพบ: {0}
vi_vn: Phát hiện: {0}
zh_cn: 检测到：{0}
zh_tw: 偵測到：{0}

source: OK
ar_sa: موافق
hi_in: ठीक है
ko_kr: 확인
th_th: ตกลง
zh_cn: 确定
zh_tw: 確定

# ServiceGoogle
source: Google Translate
fr_fr: Google Traduction
ja_jp: Google翻訳
ko_kr: Google 번역
zh_cn: Google 翻译
zh_tw: Google 翻譯

# ServiceOllama
source: Ollama (Local)
ar_sa: Ollama (محلي)
da_dk: Ollama (lokal)
de_de: Ollama (Lokal)
hi_in: Ollama (स्थानीय)
id_id: Ollama (Lokal)
it_it: Ollama (Locale)
ja_jp: Ollama（ローカル）
ko_kr: Ollama (로컬)
ms_my: Ollama (Tempatan)
th_th: Ollama (ในเครื่อง)
vi_vn: Ollama (Cục bộ)
zh_cn: Ollama（本地）
zh_tw: Ollama（本機）

# ServiceBuiltIn
source: Built-in AI
ar_sa: ذكاء اصطناعي مدمج
da_dk: Indbygget AI
de_de: Integrierte KI
fr_fr: IA intégrée
hi_in: बिल्ट-इन AI
id_id: AI Bawaan
it_it: AI integrata
ja_jp: 内蔵AI
ko_kr: 내장 AI
ms_my: AI Terbina Dalam
th_th: AI ในตัว
vi_vn: AI tích hợp
zh_cn: 内置 AI
zh_tw: 內建 AI

# ServiceZhipu
source: Zhipu
ja_jp: 智譜
ko_kr: 智谱
zh_cn: 智谱
zh_tw: 智譜

# ServiceCustomOpenAI
source: Custom OpenAI
ar_sa: OpenAI مخصص
da_dk: Brugerdefineret OpenAI
de_de: Benutzerdefiniertes OpenAI
fr_fr: OpenAI personnalisé
hi_in: कस्टम OpenAI
id_id: OpenAI Kustom
it_it: OpenAI personalizzato
ja_jp: カスタムOpenAI
ko_kr: 사용자 정의 OpenAI
ms_my: OpenAI Tersuai
th_th: OpenAI ที่กำหนดเอง
vi_vn: OpenAI tùy chỉnh
zh_cn: 自定义 OpenAI
zh_tw: 自訂 OpenAI

# ServiceDoubao
source: Doubao
ja_jp: 豆包
ko_kr: 豆包
zh_cn: 豆包
zh_tw: 豆包

# ServiceCaiyun
source: Caiyun
ja_jp: 彩雲小訳
ko_kr: 彩云小译
zh_cn: 彩云小译
zh_tw: 彩雲小譯

# ServiceNiuTrans
source: NiuTrans
zh_cn: 小牛翻译
zh_tw: 小牛翻譯

# ServiceLinguee
source: Linguee Dictionary
ar_sa: قاموس Linguee
da_dk: Linguee-ordbog
de_de: Linguee Wörterbuch
fr_fr: Dictionnaire Linguee
hi_in: Linguee शब्दकोश
id_id: Kamus Linguee
it_it: Dizionario Linguee
ja_jp: Linguee辞書
ko_kr: Linguee 사전
ms_my: Kamus Linguee
th_th: พจนานุกรม Linguee
vi_vn: Từ điển Linguee
zh_cn: Linguee 词典
zh_tw: Linguee 詞典

# TrayShow
source: Show Easydict
fr_fr: Afficher
ja_jp: 表示
ko_kr: 표시
zh_cn: 显示 Easydict
zh_tw: 顯示

# TrayTranslateClipboard
source: Translate Clipboard
zh_cn: 翻译剪贴板

# TrayOcrTranslate
source: OCR Translate
zh_cn: OCR 截图翻译

# TrayShowMini
source: Mini Window
ar_sa: النافذة المصغّرة
da_dk: Minivindue
de_de: Mini-Fenster
fr_fr: Mini fenêtre
hi_in: मिनी विंडो
id_id: Jendela Mini
it_it: Finestra mini
ja_jp: ミニウィンドウ
ko_kr: 미니 창
ms_my: Tetingkap Mini
th_th: หน้าต่างขนาดเล็ก
vi_vn: Cửa sổ nhỏ
zh_cn: 迷你窗口
zh_tw: 迷你視窗

# TrayShowFixed
source: Fixed Window
ar_sa: النافذة الثابتة
da_dk: Fast vindue
de_de: Fixiertes Fenster
fr_fr: Fenêtre fixe
hi_in: स्थिर विंडो
id_id: Jendela Tetap
it_it: Finestra fissa
ja_jp: 固定ウィンドウ
ko_kr: 고정 창
ms_my: Tetingkap Tetap
th_th: หน้าต่างคงที่
vi_vn: Cửa sổ cố định
zh_cn: 固定窗口
zh_tw: 固定視窗

# TrayBrowserSupport
source: Browser Support
zh_cn: 浏览器支持

# TrayBrowserChrome
source: Chrome
zh_cn: Chrome 系

# TrayBrowserFirefox
source: Firefox
zh_cn: Firefox 系

# TrayBrowserInstallChrome
source: ① Install Chrome Support
zh_cn: ① 安装 Chrome 支持

# TrayBrowserUninstallChrome
source: Uninstall Chrome Support
zh_cn: 卸载 Chrome 支持

# TrayBrowserInstallFirefox
source: ① Install Firefox Support
zh_cn: ① 安装 Firefox 支持

# TrayBrowserUninstallFirefox
source: Uninstall Firefox Support
zh_cn: 卸载 Firefox 支持
